{
  "title": "Same Signal, New Frequency: A Message From the Crew",
  "date": "2025-06-04",
  "author": "tothehilt",
  "content": [
    "If you’ve been with us for a while, you’ve probably noticed things look a little different around here. New name, new site, same group — same weirdos behind the screen.",
    "For those who don’t know, we started out as a DEFCON Group back in the day. Back when beer-fueled talks and sketchy projector setups in random rooms were our normal. We slapped together flyers in GIMP, printed ’em at work, and handed them out like underground zines. We met monthly (sometimes more, sometimes less, depending on whose kid was sick and what threat report just dropped) and built a little home for hackers, researchers, tinkerers, and curious minds.",
    "Over time, we realized we weren’t just a local node in the DEFCON network anymore. We’d grown into something… not bigger, necessarily, but more us. We’re still grateful to DEFCON — they gave us a home when we were just getting started — but it’s time for the next chapter.",
    "So What’s Changing?",
    "•\tWe’re no longer operating as a DEFCON Group.",
    "•\tWe’ve rebranded under our own banner — a name that reflects our independence, our local scene, and the slightly older but still curious hackers we’ve become.",
    "•\tWe’re still meeting. Still open to newcomers. Still chasing the same signal.",
    "What’s Staying the Same?",
    "Everything that should stay the same:",
    "•\tWe’re still about community.",
    "•\tWe’re still about learning.",
    "•\tWe still believe no one’s too new, too old, or too out-of-touch to hack on cool stuff.",
    "Whether you’re reverse engineering malware, building RF toys, poking APIs, or just curious what this “infosec” thing even is — there’s a place for you here.",
    "Let’s Talk History",
    "I dug through a few old folders the other night. Found some of our early flyers — janky fonts, pixelated skulls, bad puns. But damn, they had soul. That’s not how people found us, nor through SEO. Not through LinkedIn. Through curiosity and word of mouth.",
    "<div style='text-align: center;'><img src='https://raw.githubusercontent.com/DC423/Flyers/refs/heads/main/flyer_12_2012.jpg' width='300' height='300'></div>",
    "We’ve drifted a bit from that DIY energy. I’m guilty of it too. Life gets busy. Kids, jobs, burnouts, burnout from burnout. But looking ahead, I want to get back to what made this group special: community-built, community-run, and community-fed.",
    "Help Wanted (That Means You)",
    "I’ve got a handful of projects collecting digital dust that I’d love to bring into the light:",
    "•\tBuilding a more open archive of our past talks",
    "•\tHosting hands-on workshops again (you remember solder smoke and bad Python, right?)",
    "•\tBuilding tools, CTFs, and maybe even running a mini-con (Bsides Shattanooga) again",
    "But I can’t do this alone.",
    "If you’re sitting on ideas, skills, time (even a little), or just want to see this group evolve — reach out. Drop into the next meeting. Send me a DM. Show up and say, “I’ve got a thing.”",
    "This isn’t about turning into some polished brand. This is about staying weird, staying curious, and making space for the next person walking in the door wondering if they belong. (They do.)",
    "Final Words",
    "We might have a new look, but the heartbeat hasn’t changed. We’re still the same hackers, researchers, tinkerers, and oddballs who believe in sharing knowledge, lifting each other up, and occasionally breaking stuff just to see how it works.",
    "Thanks for sticking around.",
    "See you at the next meetup.",
    "— Tothehilt",
    "aka: Still figuring it out, like the rest of us."
  ]
}
